tap "1password/tap"
tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "michaeleisel/zld"
tap "surrealdb/tap"
brew "ca-certificates"
brew "openssl@3"
brew "asdf"
brew "python@3.11"
brew "awscli"
brew "bat"
brew "berkeley-db", link: true
brew "brotli"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "glib"
brew "cairo"
brew "chezmoi"
brew "unbound"
brew "gnutls"
brew "qemu"
brew "colima"
brew "docker", link: false
brew "docker-credential-helper-ecr"
brew "doctl"
brew "exa"
brew "gdk-pixbuf"
brew "gh"
brew "little-cms2"
brew "giflib"
brew "gnupg"
brew "pkg-config"
brew "gobject-introspection"
brew "harfbuzz", link: false
brew "openjdk"
brew "gradle"
brew "guile"
brew "helix"
brew "htop"
brew "jpeg"
brew "jq"
brew "krb5"
brew "libarchive"
brew "libfido2"
brew "pango"
brew "librsvg"
brew "luv"
brew "mas"
brew "maven"
brew "mysql"
brew "n"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "nghttp2"
brew "node", link: false
brew "nushell"
brew "openjdk@17"
brew "tmux"
brew "overmind"
brew "pandoc"
brew "pipx"
brew "postgresql@15"
brew "ripgrep"
brew "rust-analyzer"
brew "starship"
brew "swi-prolog"
brew "tere"
brew "trunk"
brew "watchexec"
brew "wget"
brew "wimlib"
brew "wireguard-tools"
brew "yadm"
brew "yarn"
brew "zsh-syntax-highlighting"
brew "stripe/stripe-cli/stripe"
brew "surrealdb/tap/surreal"
cask "1password-cli"
cask "alacritty"
cask "alt-tab"
cask "balenaetcher"
cask "canva"
cask "chromium"
cask "dbeaver-community"
cask "docker"
cask "figma"
cask "fliqlo"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-new-york"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-pro"
cask "google-chrome"
cask "google-drive"
cask "hiddenbar"
cask "imageoptim"
cask "karabiner-elements"
cask "maccy"
cask "mactex-no-gui"
cask "notion"
cask "obsidian"
cask "postico"
cask "postman"
cask "raycast"
cask "scroll-reverser"
cask "visual-studio-code"
cask "vlc"
cask "vscodium"
cask "warp"
cask "wezterm"
vscode "alexcvzz.vscode-sqlite"
vscode "blanu.vscode-styled-jsx"
vscode "DavidAnson.vscode-markdownlint"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "freebroccolo.sml"
vscode "GitHub.copilot"
vscode "Gruntfuggly.todo-tree"
vscode "James-Yu.latex-workshop"
vscode "mattn.Lisp"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "nvarner.typst-lsp"
vscode "qingpeng.common-lisp"
vscode "redhat.java"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "tomoki1207.pdf"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
