# Taps
tap "dbt-labs/dbt-cli"
tap "stripe/stripe-cli"
tap "supabase/tap"

# Core dependencies
brew "ca-certificates"
brew "openssl@3"

# Terminal & Shell
brew "bat"                    # Better cat with syntax highlighting
brew "eza"                    # Modern ls replacement
brew "fd"                     # Fast find alternative
brew "fzf"                    # Fuzzy finder
brew "ripgrep"                # Fast grep
brew "starship"               # Cross-shell prompt
brew "tmux"                   # Terminal multiplexer
brew "tree"                   # Directory tree viewer
brew "zoxide"                 # Smart cd
brew "zsh-syntax-highlighting"

# Development Tools
brew "cmake"                  # Build tool
brew "gh"                     # GitHub CLI
brew "git-delta"              # Better git diffs
brew "git-lfs"                # Git large file storage
brew "jq"                     # JSON processor
brew "lazygit"                # Git TUI
brew "neovim"                 # Text editor
brew "watchexec"              # File watcher

# Languages & Runtimes
brew "go"                     # Go language
brew "n"                      # Node version manager
brew "nushell"                # Modern shell
brew "openjdk@21"             # Java
brew "python-lsp-server"      # Python LSP
brew "r"                      # R language
brew "rust"                   # Rust language
brew "rust-analyzer"          # Rust LSP

# Python Tools
brew "ipython"                # Interactive Python
brew "jupyterlab"             # Jupyter notebooks
brew "ruff"                   # Fast linter
brew "uv"                     # Fast package manager

# Database Tools
brew "duckdb"                 # OLAP database
brew "postgresql@17"          # PostgreSQL
brew "sqlfluff"               # SQL linter

# Cloud & DevOps
brew "awscli"                 # AWS CLI
brew "doctl"                  # DigitalOcean CLI
brew "k9s"                    # Kubernetes TUI
brew "kubernetes-cli"         # kubectl
brew "overmind"               # Process manager

# Package Managers
brew "pnpm"                   # Fast npm alternative
brew "yarn"                   # JavaScript package manager

# Utilities
brew "bottom"                 # System monitor (btm)
brew "gnu-sed"                # GNU sed
brew "gnupg"                  # GPG
brew "htop"                   # Process viewer
brew "wget"                   # File downloader
brew "yadm"                   # Dotfiles manager

# Media & Graphics
brew "ffmpeg"                 # Media processing
brew "ghostscript"            # PostScript/PDF
brew "imagemagick"            # Image processing

# Platform-specific tools
brew "mas"                    # Mac App Store CLI
brew "databricks/tap/databricks"
brew "stripe/stripe-cli/stripe"
brew "supabase/tap/supabase"

# Casks - Core Applications
cask "1password-cli"          # Password manager CLI
cask "alt-tab"                # Better window switcher
cask "ghostty"                # Primary terminal
cask "google-chrome"          # Web browser
cask "google-drive"           # Cloud storage
cask "karabiner-elements"     # Keyboard customizer
cask "maccy"                  # Clipboard manager
cask "monitorcontrol"         # External monitor control
cask "orbstack"               # Docker alternative
cask "raycast"                # Launcher
cask "visual-studio-code"     # Code editor

# Casks - Productivity
cask "discord"                # Communication
cask "figma"                  # Design
cask "notion"                 # Notes
cask "obsidian"               # Knowledge base
cask "postman"                # API testing
brew "httpie"                 # Command-line HTTP client
cask "httpie-desktop"         # Testing client for REST, GraphQL, and HTTP APIs
cask "zoom"                   # Video calls
cask "zotero"                 # Research

# Casks - Database
cask "dbeaver-community"      # Universal DB client
cask "postico"                # PostgreSQL GUI

# Casks - Media
cask "vlc"                    # Media player

# Fonts
cask "font-fira-code-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"

# Mac App Store
mas "1Password for Safari", id: 1569813296
mas "Grammarly for Safari", id: 1462114288
mas "Slack", id: 803453959
mas "Spark Desktop", id: 6445813049  
mas "Todoist", id: 585829637
mas "WireGuard", id: 1451685025

# VS Code Extensions - Core Only
vscode "charliermarsh.ruff"
vscode "databricks.databricks"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-vscode-remote.remote-ssh"
vscode "rust-lang.rust-analyzer"
vscode "vscodevim.vim"
